# GIT - распределенная система контроля версий.
# Это система для отслеживания и ведения истории изменения файлом, в вашем проекте

# Репозиторий - хранилище вашего кода и истории его изменений

# GitHub - веб сайт для размещения git-репозиториев и совместной разработки проектов.


# Команды Git

# 1. git init - она создает новый гит репозиторий локальнь на вашем пк

# 2. git commit - как только мы достигаем опредленного момента в разработке, то тогда мы сохраняем и комментируем измения.(фиксация изменений в репо) 
# git commit -m '<comment>'

# 3. git add - когда мы создаем или изменяем файлы, то при помощи этой команды мы закружаем все изменения в локальное хранилище

# git add <название файла>
# git add .

# 4. git remote add - это команда для того чтобы связать ваш проект с удаленным репозиторием(репо в гитхаб)

# git remote add <название подключения> <ссылка на репо>

# git remote add origin <url>

# 5. git push - после коммита изменений при помощи этой команды мы отправляем наши изменнения на удаленный репозиторий

# git push <название ветки>





