1




CTRL+ALT+T - команда открытия терминала (В спотлайт вводим Terminal)

~ - символ домашней директории(папки)
/ - символ корневой директории(папки)

.. - оюозночают предыдущую дерикторию
. - обозначает текущию дерикторию 

1. ls(list) -> выводит список всех папок(директорий) и файлов в текущей рабочей директории

2. cd(change directory) -> менят текущую директорию(папку) на указанную
(cd <название директории>)

3. touch -> создает указанный файл (touch <name_of_file>)

4. pwd (present working directory) -> выводит путь до текущей директории(папка)

5. mkdir(make directory) -> создает указанную директорию

6. rmdir(remove directory) -> удаляет указанную директорию

7. rm -rf -> принудительное удаление

8. rm -> удаление файла

9. ls -a -> выводит список как скрытых так и обычных директорий и файлов

10. nano <path_to_file> -> открывает графический интерфейс для редактирования файла
*если нет указанного файла, то создаться новый файл с таким именем

11. cat <path_to_file> -> выводит содержимое файла
